/* Boxcar email address field label */
"Email Address:" = "Διεύθυνση Email:";

/* Failure adding email */
"Invalid Email" = "Μη Έγκυρο Email";

/* Checkbox for only sending if idle by growl's idle detection */
"Only send if idle:" = "Αποστολή μόνο αν είμαι ανενεργός:";

/* Checkbox for sending only if priority is above a certain value */
"Only send if priority is at least:" = "Αποστολή μόνο εαν η προτεραιότητα είναι:";

/* Prefix notifications to boxcar checkbox */
"Prefix notifications with:" = "Εισαγωγή προθέματος στις ειδοποιήσεις:";

/* Success adding boxcar */
"Registered!" = "Έγινε Εγγραφή!";

/* Failed adding boxcar, unknown email address */
"Unknown email" = "άγνωστο email";

